In [1]:
import pandas as pd

In [4]:
dataFrame = pd.read_excel("maas.xlsx")

In [5]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   150  50.0      Satış
2     Mehmet   200   3.0        NaN
3      Ahmet    50  10.0  Pazarlama
4      Atlas   150   NaN     Finans
5      Fatma   200  25.0      Hukuk

In [7]:
doluDegerlerDataFrame = dataFrame.dropna()

In [8]:
doluDegerlerDataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   150  50.0      Satış
3      Ahmet    50  10.0  Pazarlama
5      Fatma   200  25.0      Hukuk

In [9]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   150  50.0      Satış
2     Mehmet   200   3.0        NaN
3      Ahmet    50  10.0  Pazarlama
4      Atlas   150   NaN     Finans
5      Fatma   200  25.0      Hukuk

In [11]:
doluDegerlerDataFrame.to_excel("yenimaas.xlsx")

In [12]:
## read_csv
## to_csv